## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 7 to add, 6 to change, 7 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.form_viewer_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "form_viewer_task"  {
      ~ id       = "d860f4b473912678133a3f101afb77ca7e1e46354703ef71fa47611222b106ac" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organisations"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-staging-reliability-file-storage"
                        },
                    ]
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.form_viewer must be replaced
-/+ resource "aws_ecs_task_definition" "form_viewer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/form-viewer:247" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organisations"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-staging-reliability-file-storage"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "form-viewer" -> (known after apply)
      ~ revision                 = 247 -> (known after apply)
        tags                     = {
            "CostCentre" = "Forms"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_lambda_function.load_testing will be updated in-place
  ~ resource "aws_lambda_function" "load_testing" {
        id                             = "LoadTesting"
      ~ last_modified                  = "2021-09-22T13:36:42.207+0000" -> (known after apply)
      ~ source_code_hash               = "87dHZVkNn5f66qYBNIp4WqArzu8c6gXwObV45gSc3Dg=" -> "5mR3b81t9k8RJ8oRkW+Kk4ii3MAqjn9ZJiCQEo0sIUk="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.organisations will be updated in-place
  ~ resource "aws_lambda_function" "organisations" {
        id                             = "Organisations"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:22",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:23",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IRCC_CONFIG"          = "eyJmb3JtcyI6WzgxLDgzXSwicHJvZ3JhbUZpZWxkSUQiOjIsImxhbmd1YWdlRmllbGRJRCI6NCwiY29udGFjdEZpZWxkSUQiOjMsImxpc3RNYXBwaW5nIjp7IkVuZ2xpc2giOnsiSW1taWdyYXRpb24gcHJvZ3JhbSBmb3IgQWZnaGFucyB3aG8gYXNzaXN0ZWQgdGhlIEdvdmVybm1lbnQgb2YgQ2FuYWRhIGFuZCB0aGVpciBlbGlnaWJsZSBmYW1pbHkgbWVtYmVycy4iOnsicGhvbmUiOiJiYWNjYmE4Mi02MDg3LTQ2OTctOGU5MS1lZmUwNmU3MzU3MmUiLCJlbWFpbCI6ImJhZTFjYjU4LTg3OTItNDQ5Mi1iMzVjLWIxNTk1YTE2MWFlMiJ9LCJIdW1hbml0YXJpYW4gcHJvZ3JhbSB0byBoZWxwIEFmZ2hhbiBuYXRpb25hbHMgcmVzZXR0bGUgdG8gQ2FuYWRhLiI6eyJwaG9uZSI6IjI4ZmVjMjgzLWIyNWItNDdjMS05OWVlLWU0OGMyMDhlZmEyMyIsImVtYWlsIjoiYWIyNmE2YjUtNTdhYS00Y2MyLTg1ZmUtMzA1M2VkMzQ0ZmU4In19LCJBbmdsYWlzIjp7IlByb2dyYW1tZSBk4oCZaW1taWdyYXRpb24gcG91ciBsZXMgQWZnaGFucyBxdWkgb250IGFpZMOpIGxlIGdvdXZlcm5lbWVudCBkdSBDYW5hZGEgZXQgbGVzIG1lbWJyZXMgYWRtaXNzaWJsZXMgZGUgbGV1cnMgZmFtaWxsZXMuIjp7InBob25lIjoiYmFjY2JhODItNjA4Ny00Njk3LThlOTEtZWZlMDZlNzM1NzJlIiwiZW1haWwiOiJiYWUxY2I1OC04NzkyLTQ0OTItYjM1Yy1iMTU5NWExNjFhZTIifSwiUHJvZ3JhbW1lIGh1bWFuaXRhaXJlIHBvdXIgYWlkZXIgbGVzIGFmZ2hhbnMgw6Agc+KAmWluc3RhbGxlciBhdSBDYW5hZGEuIjp7InBob25lIjoiMjhmZWMyODMtYjI1Yi00N2MxLTk5ZWUtZTQ4YzIwOGVmYTIzIiwiZW1haWwiOiJhYjI2YTZiNS01N2FhLTRjYzItODVmZS0zMDUzZWQzNDRmZTgifX0sIkZyZW5jaCI6eyJJbW1pZ3JhdGlvbiBwcm9ncmFtIGZvciBBZmdoYW5zIHdobyBhc3Npc3RlZCB0aGUgR292ZXJubWVudCBvZiBDYW5hZGEgYW5kIHRoZWlyIGVsaWdpYmxlIGZhbWlseSBtZW1iZXJzLiI6eyJwaG9uZSI6IjUzMzQyNGM2LTUxMzAtNDMzMS1hNGZhLTQyYjBjNjliNmUxMSIsImVtYWlsIjoiY2RmN2QzNzAtNzFjMi00OGFkLTlkNTktNGUyZjdiOWI4MjhhIn0sIkh1bWFuaXRhcmlhbiBwcm9ncmFtIHRvIGhlbHAgQWZnaGFuIG5hdGlvbmFscyByZXNldHRsZSB0byBDYW5hZGEuIjp7InBob25lIjoiNDQ5M2JlOTEtNGVlMi00MmNjLTg3ZDYtOWU0ZWI4YTA4NTU0IiwiZW1haWwiOiJlYmE3OWVkYS0wY2I2LTRmZjYtYmUwMy1hNmZkZTE1NjVkOTYifX0sIkZyYW7Dp2FpcyI6eyJQcm9ncmFtbWUgZOKAmWltbWlncmF0aW9uIHBvdXIgbGVzIEFmZ2hhbnMgcXVpIG9udCBhaWTDqSBsZSBnb3V2ZXJuZW1lbnQgZHUgQ2FuYWRhIGV0IGxlcyBtZW1icmVzIGFkbWlzc2libGVzIGRlIGxldXJzIGZhbWlsbGVzLiI6eyJwaG9uZSI6IjUzMzQyNGM2LTUxMzAtNDMzMS1hNGZhLTQyYjBjNjliNmUxMSIsImVtYWlsIjoiY2RmN2QzNzAtNzFjMi00OGFkLTlkNTktNGUyZjdiOWI4MjhhIn0sIlByb2dyYW1tZSBodW1hbml0YWlyZSBwb3VyIGFpZGVyIGxlcyBhZmdoYW5zIMOgIHPigJlpbnN0YWxsZXIgYXUgQ2FuYWRhLiI6eyJwaG9uZSI6IjQ0OTNiZTkxLTRlZTItNDJjYy04N2Q2LTllNGViOGEwODU1NCIsImVtYWlsIjoiZWJhNzllZGEtMGNiNi00ZmY2LWJlMDMtYTZmZGUxNTY1ZDk2In19fX0K" -> "eyJmb3JtcyI6WzgxLDgzXSwibGFuZ3VhZ2VGaWVsZElEIjozLCJjb250YWN0RmllbGRJRCI6MiwibGlzdE1hcHBpbmciOnsiRW5nbGlzaCI6eyJwaG9uZSI6ImIxY2I3ZTFiLTIzZDktNDA0Yy05ZWY3LWI1NzY0MjIwNGEwMSIsImVtYWlsIjoiOGVlMDE1NDctMDVhYi00NzVjLTkzNGQtOGJmMmUzY2NiMDQ4In0sIkFuZ2xhaXMiOnsicGhvbmUiOiJiMWNiN2UxYi0yM2Q5LTQwNGMtOWVmNy1iNTc2NDIyMDRhMDEiLCJlbWFpbCI6IjhlZTAxNTQ3LTA1YWItNDc1Yy05MzRkLThiZjJlM2NjYjA0OCJ9LCJGcmVuY2giOnsicGhvbmUiOiI2OTYxYzFhMC1kODMzLTRmNWQtYjIyNC0xMzFkZDdkY2E2ZWQiLCJlbWFpbCI6IjdlZjU5NjZkLWRhODItNGI5MC1hMTk0LWJhMGMyNzI5MWRhOCJ9LCJGcmFuw6dhaXMiOnsicGhvbmUiOiI2OTYxYzFhMC1kODMzLTRmNWQtYjIyNC0xMzFkZDdkY2E2ZWQiLCJlbWFpbCI6IjdlZjU5NjZkLWRhODItNGI5MC1hMTk0LWJhMGMyNzI5MWRhOCJ9fX0="
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.retrieval will be updated in-place
  ~ resource "aws_lambda_function" "retrieval" {
        id                             = "Retrieval"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.templates will be updated in-place
  ~ resource "aws_lambda_function" "templates" {
        id                             = "Templates"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.organisations_lib must be replaced
-/+ resource "aws_lambda_layer_version" "organisations_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1" -> (known after apply)
      ~ created_date                = "2021-07-13T19:14:04.495+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "QO1V+FhaIkZjr6Sl850U1vEKTXny0o1rGzhWUbBXbkw=" -> "48EJ84qpIym5jelu9uB98J+dCWlegI822XLuZb1ncP0=" # forces replacement
      ~ source_code_size            = 2483467 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_lib must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:22" -> (known after apply)
      ~ created_date                = "2021-09-22T13:36:48.559+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:22" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "MAxFaYb8/8CauB7BLGx8/dzzFEVJyDim1vz0EyW/rl0=" -> "AAFJyvxn83eyDy5qbD9vh3U1xtfsq5pU0bJ5zbb/vcI=" # forces replacement
      ~ source_code_size            = 6973 -> (known after apply)
      ~ version                     = "22" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:23" -> (known after apply)
      ~ created_date                = "2021-09-22T13:36:45.128+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:23" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "B2mQ17aJcxvXwaaYuUglp9jwu7HdtK38fsLY6dGUYSc=" -> "sFbNg/tsAOBq5i1zPO9beawMqcYpJvz63Spte8c/lII=" # forces replacement
      ~ source_code_size            = 13664523 -> (known after apply)
      ~ version                     = "23" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.retrieval_lib must be replaced
-/+ resource "aws_lambda_layer_version" "retrieval_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3" -> (known after apply)
      ~ created_date                = "2021-06-28T19:53:44.191+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "RvSAqGag7CLOZltsLTfxoXP+3wBhARo6PjRibsXSP30=" -> "qcHId9Wnzl7ceyjE5U6ggZpbWencqEGKHx4OP0LSAx4=" # forces replacement
      ~ source_code_size            = 3316708 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.submission_lib must be replaced
-/+ resource "aws_lambda_layer_version" "submission_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4" -> (known after apply)
      ~ created_date                = "2021-04-29T12:58:47.849+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "51vLtKdfwIEdnPUHX/lC01ol1wk+LX9kaGerlVkbjgU=" -> "1ARs9b+tsfyvs0fVLZZD65WBYoowJENJqyCGclujT+w=" # forces replacement
      ~ source_code_size            = 3263905 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.templates_lib must be replaced
-/+ resource "aws_lambda_layer_version" "templates_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3" -> (known after apply)
      ~ created_date                = "2021-06-29T16:11:14.218+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "l1lxGU/o2C15AooV3dMWSp7XVXB2tnX6151tAaMh0Fc=" -> "abA8dRapPg32CDFgXsq6VHV5IWNMypeQKz8lRY0qZHo=" # forces replacement
      ~ source_code_size            = 2403413 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 6 to change, 7 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>